Tools/src/Catalogs/ОИМЦ_63_Организации/ОИМЦ_63_Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОИМЦ_63_Организации</name>
  <attributes>
    <name>ОргИд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Tools/src/Catalogs/ОИМЦ_63_Организации/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	ТЗ = ОИМЦ_Данные.ЗапросДанных63("select uuid::varchar, ""name"", orgid, extid from documents.check_clinic;");
	Если ТЗ <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Для каждого Элемент Из ТЗ Цикл
			Поиск = Справочники.ОИМЦ_63_Организации.НайтиПоРеквизиту("ОргИд", Элемент.orgid);
			Если Поиск.Пустая() Тогда
				НО = Справочники.ОИМЦ_63_Организации.СоздатьЭлемент();
				НО.Наименование = СокрЛП(Элемент.name);
				НО.ОргИд = Элемент.orgid;
				НО.УИД = Элемент.uuid;
				НО.ОГРН = Элемент.extid;			
				НО.Записать();	
			Иначе
				СО = Поиск.ПолучитьОбъект();
				СО.Наименование = СокрЛП(Элемент.name);
				СО.ОргИд = Элемент.orgid;
				СО.УИД = Элемент.uuid;
				СО.ОГРН = Элемент.extid;			
				СО.Записать();	
			КонецЕсли; 			
		КонецЦикла; 
	КонецЕсли; 
КонецПроцедуры
